blog-posts/2004-11-22-page-rank-and-thoughts-on-online-popularity.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Page rank and thoughts on online popularity</title>
<!-- 2014-04-30 Wed 17:35 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Page rank and thoughts on online popularity</h1>
<p>
November 22nd, 2004 -
<a href="http://sachachua.com/blog/p/2421"><a href="http://sachachua.com/blog/p/2421">http://sachachua.com/blog/p/2421</a></a>
</p>

<p>
Warning: this entry not expected to be coherent. Following one of my
 software mantras, I will get this entry out the door first, \<sub>then\</sub>_
 worry about making my ideas neat. I normally try to be more coherent,
 but today I also need to pack, so I don't have the time to make this
 shorter.
</p>

<p>
(It's true. Short, clear entries take longer to write.)
</p>

<p>
I just got mail from dlpusa.com, a Philippine e-commerce site. They
 offered a link exchange, citing their PageRank of 6 and Alexa
 traffic rank of 196,446.
</p>

<p>
I'm linking to them as a matter of course in this blog entry, but I
 don't think I'll take them up on the link exchange offer. I don't want
 to inflict advertising on my planner pages. Except for Google text
 ads, maybe. =)
</p>

<p>
Anyway, that made me curious, so I checked my Google PageRank
 through the handy non-toolbar-dependent calculator at
</p>

<p>
<a href="http://www.top25web.com/pagerank.php"><a href="http://www.top25web.com/pagerank.php">http://www.top25web.com/pagerank.php</a></a>
. It turns out that
 <a href="http://sacha.free.net.ph"><a href="http://sacha.free.net.ph">http://sacha.free.net.ph</a></a> has a pagerank
of 5/10 .
</p>

<p>
I don't know if PageRank is all that useful for me. People
 generally stumble upon my site looking for very specific things, like
 planner.el or my history notes. (Odd, that.) Or they're my
 friends/family and read my blog in order to find out what's going on
 in my life. (Whoops.) Or they're looking for their own name, and I
 have a higher pagerank than they do.
</p>

<p>
Most of my URL posts are now over at
<a href="http://del.icio.us/sachac"><a href="http://del.icio.us/sachac">http://del.icio.us/sachac</a></a> .
 del.icio.us is cool. You should try it out. I post links here when
 I feel the need for commentary, but del.icio.us is good for
 fire-and-forget as well as social bookmarking.
</p>

<p>
Actually, what I need is something that'll put a mention in both
 del.icio.us and the URL&#x2026; Hmm. That'd make a nice remember module.
</p>

<p>
Anyway, my ego can take the idea that I'm probably just an entry in
 people's RSS aggregators. ;) You know, the kind of thing you subscribe
 to one day, and then are too lazy to remove. Hehehe. I'll try not to
 overload your inbox, then, and I'll try to use meaningful subjects.
</p>

<p>
Hmm. What is this blog for?
</p>

<ul class="org-ul">
<li>Not online popularity in itself. That's silly.
</li>

<li>Personal memory. Seriously. It's not your fault that M-x remember is
</li>
</ul>

<blockquote>
<p>
bound to a convenient shortcut (F9 r SPC on this machine), but
 that's the reason you suffer through all the strangest emacs-lisp
 snippets and commentary on mail that's not actually viewable on the
 Net anyway.
</p>
</blockquote>

<ul class="org-ul">
<li>Projects I feel deserve more attention. Please check them out. Also,
</li>
</ul>

<blockquote>
<p>
please tell me about similar stuff I can learn about and link to.
</p>
</blockquote>

<ul class="org-ul">
<li>The occasional rambling pseudo-essay, like this one. I hope to achieve
</li>
</ul>

<blockquote>
<p>
<a href="http://www.paulgraham.org"><a href="http://www.paulgraham.org">http://www.paulgraham.org</a></a> -like
coherence at some point in time.
 I hope said point is before my death.
</p>
</blockquote>

<ul class="org-ul">
<li>Emacs Lisp code. Shell scripts. Random hacks. Geeky stuff.
</li>

<li>Occasionally, my personal life. Sorry if that freaks you out. =)
</li>
</ul>

<p>
If you tell me what you like, I'll write more about it.
</p>

<p>
So going back to the very first thing&#x2026; What sites would I like to link
to?
</p>

<ul class="org-ul">
<li>Thought-provoking questions. Preferably stuff that'll provide me
</li>
</ul>

<blockquote>
<p>
with procrastination fodder, causing me to go off on a wild tangent
 as I figure out what I think about the issue (and thus avoid having
 to think about the packing I have to do later)&#x2026;
</p>
</blockquote>

<ul class="org-ul">
<li>Nifty hacks.
</li>

<li>Insightful blogs. Interesting ideas. Blogs that show an awareness of
</li>
</ul>

<blockquote>
<p>
a universe outside the author's close circle of friends. That sort
 of thing.
</p>
</blockquote>

<ul class="org-ul">
<li>Stuff that looks like it should be in my blog, but isn't.
</li>

<li>Yours. I'm curious about the intersection of interests.
</li>
</ul>

<p>
Ish.
</p>

<p>
Drop me a note?
</p>

<p>
E-Mail%20from%20Marc%20Hil%20Macalua
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
